#Область ОбработчикиСобытийЭлементовФормы

&НаКлиенте
Процедура ФиксированныеНастройкиОтборВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)

	Если Поле = Элементы.ФиксированныеНастройкиОтборПравоеЗначение Тогда
		ПоказатьЗначение(, SettingsComposer.FixedSettings.Отбор.ПолучитьОбъектПоИдентификатору(ВыбраннаяСтрока).ПравоеЗначение);
	КонецЕсли; 

КонецПроцедуры

&НаКлиенте
Процедура НастройкиОтборВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)

	Если Поле = Элементы.НастройкиОтборПравоеЗначение Тогда
		ПоказатьЗначение(, SettingsComposer.Настройки.Отбор.ПолучитьОбъектПоИдентификатору(ВыбраннаяСтрока).ПравоеЗначение);
	КонецЕсли; 

КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)

	Если ЗначениеЗаполнено("" + Параметры.FixedSettings.Отбор) Тогда 
		Представление = "1";
	Иначе
		Представление = "0";
	КонецЕсли;
	Элементы.FixedSettings.Заголовок = Элементы.FixedSettings.Заголовок + "(" + Представление + ")";
	Если ЗначениеЗаполнено("" + Параметры.Настройки.Отбор) Тогда 
		Представление = "1";
	Иначе
		Представление = "0";
	КонецЕсли;
	Элементы.StandartSettings.Заголовок = Элементы.StandartSettings.Заголовок + "(" + Представление + ")";

КонецПроцедуры

#КонецОбласти